1,既成事実
;(BIT 0=キス 1=うふふ 2=恋人 3=A 4=SM)
2,好感度
3,異常経験
4,信頼度
6,態度
7,基本服装セット
8,服装オプション
10,弱み握り
11,弱み握られ
12,デート中
13,デート後イベントフラグ
14,生解禁
15,ローター挿入
16,ローターA挿入
17,ダメ出し
18,面識
19,合意判定
20,宴会参加
;（0=不参加 1=参加 2=主催者 3=脱落済み）

30,神社在住
;CFLAG:神社在住は「MAIN_MAPの住人である場合に自室の場所ID（拠点マップ版）を記録」している（MAIN_MAPに住んでいない場合は0）
31,引き継ぎ
;(BIT 0=恋慕 1=恋人 2=自慰狂い 3=淫壺 4=尻穴狂い 5=淫乳 6=キス魔)
32,大家候補
33,住み込み必要信頼度
34,家賃
35,固有コマンド
36,口上実装状況
;37,固有料理
;LEARNED_MENUへ移行,固有料理の経験値,100以上でラーニング済み,一度覚えると100+DAYに変化

;40,浮気バレ

41,オナバレ
;(1=目撃された 2=見られてキレた 3=ヤられちゃった)
42,夜這い
;(BIT 0=ソフト1=セクハラ2=ガチセクハラ3=合意非挿入4=合意ックス5=レイプ6=説得7=逃亡8=侵入成功)
43,ヤラせちゃった
;合意なしで行為に及んだ場合つく


;100～139までパンツ管理に使用中（4.600proto現在）

;CFLAG:200～239はノーマル服装パターン記憶用
;CFLAG:240～260はパジャマパターン記憶用



284,勃起度
285,勃起度２
286,膣内射精
287,アナル射精
288,口に精液
289,顔に精液
290,手に精液
291,ノーパン
292,無自覚破瓜用
293,パンツ2
294,あなたのパンツ
295,ただならぬ開放感ソース追加

300,现在位置
301,前ターン位置
302,あなた前ターン位置
310,地位
311,初期位置
;CFLAG:初期位置は一日を開始した時点での各キャラの開始位置、拠点マップ上の位置を記録してある
;MAIN_MAPの住人でない場合にはSUKIMA()送りになっている（＝99）
;これを使うだけでは自室の位置はわからない（MAIN_MAPに住んでいないキャラの情報がわからない）
;MAIN_MAPの住人だとCFLAG:神社在住と同じ、CHARAxx.CSVを参照すると拠点での自室位置がわかる
;312,起床時間
;時刻系はCFLAG:350～を見よ
313,睡眠
;314,起床時間
;315,就寝時間
316,衰弱
317,うふふ
318,ブチギレ
319,同室
320,同行
321,幽閉
322,不機嫌
323,風呂
324,情事目撃
325,行動
326,職場
327,行動時間
328,徹夜
329,同行準備
330,隠密中
331,イタズラ
332,味覚嗜好
333,ディレイ
334,添い寝中
335,大掃除
336,お招き
337,遭遇位置
338,清い交際
339,体目当て
340,溜まってる度
341,時間停止着せ替え
;342,休日移動済
343,パジャマ
344,時間停止行動
345,時間停止バレ
346,今忙しくて手が離せない
347,オナニーした
348,片付け仕事量
349,片付け場所

350,職種
;40,清掃 41,会話 42,戦闘 43,教養 44,料理 45,音楽 46,遊び 47,商売中 48,宴会の準備 49,宴会に参加 50,片づけ 51,宴会後の酔い 52,お酒 53,家事 54,採集 55,釣り 56,調合
351,身体測定
352,来訪時間
353,帰宅時間
354,就寝時間
355,起床時間
356,よく行く地域
357,出現位置
358,自宅位置
;CFLAG:自宅位置は「おでかけマップ上の自宅位置」を示し、お招き部屋の入り口の判定に使われている
;拠点マップでは使えない点に要注意
359,拠点来訪
360,出禁
361,通年
362,翌日来訪
363,移動率補正
364,移動節度
365,最後に来訪した日
366,来訪抑制値
367,素材販売
368,めくれ補正
370,眠姦発覚
371,眠姦口上有
372,時間停止口上有
373,なりきり口上有
374,破瓜キャンセル口上有
375,口上内抱き寄せ判定_初回
376,口上内抱き寄せ判定_通常
377,押し倒し禁止
378,今日の運勢
379,来訪不能
380,魔力回収
381,小槌
382,変異前の形状
383,バレンタイン
384,最後に会った日
385,眠気覚まし
386,本来の初期位置
387,貰った贈り物
;MASTERは任意でお気に入りにした贈り物,CHARAはお気に入りの贈り物
388,渡した贈り物
;MASTERは贈り物を渡した述べ回数と最後に贈り物を渡したキャラの履歴,CHARAはMASTERに渡した贈り物
389,贈り物ストック
;MASTERは事前に買っておいた贈り物,CHARAは最後に貰った贈り物
390,生活時間補正
391,口調

;銭湯関連はTFLAGのみに移行
;400,大衆浴場総入湯回数
;401,旧地獄温泉総入湯回数
;402,旧地獄温泉特殊イベント

403,依頼状況
;パターンを細分化した
;   -1　依頼発生直後/ 1　依頼未受託/ 2　依頼中/ 3　依頼達成/ 4　期限切れ/ 5　報告忘れ/ 6　依頼失敗/
;    103 依頼終了（成功）/104 依頼終了（期限切れ）/105 依頼終了（報告忘れ）/106 依頼終了（失敗）
404,依頼内容

410,
411,依頼対象１
412,依頼対象２
413,依頼対象３
414,依頼対象４
415,依頼対象５

;420~431は各拠点マップへの来訪補正にする予定

;450~461は出現位置に

495,kojo_version

500,好きな体位
501,アナル開発許可
502,処女喪失記念日
503,処女喪失対象
504,処女喪失相手
505,童貞喪失記念日
506,童貞喪失相手
507,アナル処女喪失記念日
508,アナル処女喪失対象
509,アナル処女喪失相手
510,ファーストキス喪失記念日
511,ファーストキス喪失相手
512,ファーストキス喪失対象
513,Ａ破瓜違和感確認

515,累計膣内精液
516,累計アナル精液
517,累計精飲
518,累計ぶっかけ

526,潜伏状態
;(0=潜伏 1=探索 2=会話）
527,睡眠姦
;(0=なし 1=イタズラ 2=睡眠姦)
528,泥酔姦
529,下戸飲み
530,無理矢理膣射
531,陰毛

550,恥じらい
551,誘惑
552,積極性
553,タチ

560,性格傾向
561,オート喘ぎ
562,別顔有
563,別立ち有
564,差し替え適用


591,Ｖアンフィルタ
592,Ａアンフィルタ
595,奉仕アンフィルタ
596,ＳＭアンフィルタ

597,セクハラアンフィルタ
598,自動ゴム
599,allowKojoCom

;CFLAG:600～639はお気に入り衣装パターン記憶用
;CFLAG:650は衣装セットIDを指定する
;ただし、300ならお気に入り衣装、301ならパンイチ、302なら全裸が指定される
650,パジャマ指定
651,きょうのぱんつ
652,パジャマパンツ
653,指定パンツ

655,おきにいり衣装,;お気入り衣装を設定したかどうか、送り仮名がややこしいのでひらがなにします
656,衣装一時変更,;これ立っているときは服を脱がすコマンドを実行するまで普段着に戻らない

661,きょうのブラ
662,パジャマブラ
;653,指定ブラ;とりあえず実装はしない
663,上半身下着確認
664,下半身下着確認
665,パジャマ上半身下着確認
666,パジャマ下半身下着確認

;CFLAG:700　着替え実行フラグ（MASTERの目の前でのTARGETのお着替え処理）
;これちょっと工夫すればお風呂の着替えやパジャマ着替えにも応用効きそうです
700,着替え実行

900,生理周期,;7で危険日
901,子宮内精子
902,にんっしんっ
903,妊娠経過日数
904,乳ランクアップ
905,回復速度ダウン
906,無自覚妊娠
907,妊娠による追加サイズ
908,出産経過日
909,育児人数
910,身に覚え_母
911,妊娠自覚状態
912,子供人数
913,子宝補正
914,産休中
915,身に覚え_父
916,産休タイプ
917,誰の子

919,妖怪変化
920,モブ顔パターン
921,負け犬
922,モブ子セーブスロット
923,モブ子GID_服_通常
924,モブ子GID_服_笑顔
925,モブ子GID_服_怒り
926,モブ子GID_裸_通常
927,モブ子GID_裸_笑顔
928,モブ子GID_裸_怒り

930,弾幕勝負勝利
931,弾幕特能
;(BIT 0=言笑自若1=温柔敦厚2=勇気凛々3=豪放磊落4=怪力乱神5=洽覧深識6=残忍酷薄7=乾坤一擲8=狷介孤高9=幽愁暗恨)
932,ムシバトル直接勝利
933,料理勝負勝利

950,変化先
;キャラ番号
951,変化元
;キャラ番号

998,口上セレクタ,;口上及びオプションでの使用はお控えください
999,口上用引継ぎ枠,;周回しても維持されます
;Custom flag, 100 for translated, 0 for untranslated, -1 for no dialog
;997,DIALOGSTATUS - SAVEDATA will be used instead
;CFLAG:1000～1999	 口上用確保領域

9100,RANDOM_MENU_EXCLUSION
9101,REQUEST_GENERATION_DAY,;stores the day on which the request has been generated
9102,DUPLICATE_CHARACTER,;serves as a duplicate of another character, the value indicates which character they're a duplicate of
9103,MARKED_FOR_DELETION,
9104,LEWD_CHECKED
9105,LAST_SEX_DAY
9106,BANQUET
9107,BANQUET_ROLE
9108,BANQUET_CLEANUP,;used to get the correct banquet term, as BANQUET and BANQUET_ROLE can already be cleared at this point
9109,PERSISTENT_DUPLICATE,;duplicated character exists outside of sex

;custom com filters (range 9110-9119)

;9125,MORNING_TIPS,;does character have night tips, for authors
;9126,MORNING_TIPS_DISABLED,;are their night tips enabled in the settings
;9115,BUTT_SIZE_UPDATED
;9127,IS_DUPLICATE,;is a duplicated character
;9128,FAVORITE_OVERRIDE_UNDERWEAR,;overrides the underwear for the favorite outfit
;9129,WIFE_VISITATION,;wives and concubines will try to visit every day
;
;9130,PullOutPromiseDenied
;9131,EXTENDED_TRAITS_SET
;9132,ALLOW_BATH
;9133,NO_LEGS
;
;9150,Hypno_Orgasm_Denial
;9151,Morning_Event_Guaranteed
;9152,Times_Made_Exhibitionist
;9153,Times_Made_Nudist
;
;9170,WithChildCount
;9171,BirthEventsCount
;9172,LatestChildCount
;9173,LatestEggGiftDay